tests/results/fase6/jmeter/plans/JM-CON-02-stock.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JM-CON-02 Stock concurrente" enabled="true"/><hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="10 compradores para 5 unidades"><stringProp name="ThreadGroup.num_threads">10</stringProp><stringProp name="ThreadGroup.ramp_time">1</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">1</stringProp></elementProp></ThreadGroup><hashTree>
<CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="Clientes"><stringProp name="filename">${__P(dataFile)}</stringProp><stringProp name="fileEncoding">UTF-8</stringProp><stringProp name="delimiter">,</stringProp><boolProp name="quotedData">true</boolProp><boolProp name="recycle">false</boolProp><boolProp name="stopThread">true</boolProp><boolProp name="ignoreFirstLine">true</boolProp><stringProp name="variableNames">email,password,addressId,productId,sessionToken</stringProp><stringProp name="shareMode">shareMode.all</stringProp></CSVDataSet><hashTree/><ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP defaults"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp></ConfigTestElement><hashTree/><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Pedido"><collectionProp name="HeaderManager.headers"><elementProp name="Content-Type" elementType="Header"><stringProp name="Header.name">Content-Type</stringProp><stringProp name="Header.value">application/json</stringProp></elementProp><elementProp name="Cookie" elementType="Header"><stringProp name="Header.name">Cookie</stringProp><stringProp name="Header.value">elpoblano_session=${sessionToken}</stringProp></elementProp><elementProp name="Idempotency-Key" elementType="Header"><stringProp name="Header.name">Idempotency-Key</stringProp><stringProp name="Header.value">con02-${__UUID()}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/><SyncTimer guiclass="TestBeanGUI" testclass="SyncTimer" testname="Inicio simultáneo"><stringProp name="groupSize">10</stringProp><stringProp name="timeoutInMs">10000</stringProp></SyncTimer><hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="CON02 POST stock limitado"><boolProp name="HTTPSampler.postBodyRaw">true</boolProp><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"><elementProp name="" elementType="HTTPArgument"><boolProp name="HTTPArgument.always_encode">false</boolProp><stringProp name="Argument.value">{&quot;items&quot;:[{&quot;productId&quot;:&quot;${productId}&quot;,&quot;quantity&quot;:1}],&quot;paymentMethod&quot;:&quot;CREDIT_CARD&quot;,&quot;addressId&quot;:&quot;${addressId}&quot;,&quot;notes&quot;:&quot;[JM-CON-02]&quot;}</stringProp><stringProp name="Argument.metadata">=</stringProp></elementProp></collectionProp></elementProp><stringProp name="HTTPSampler.path">/api/pedidos</stringProp><stringProp name="HTTPSampler.method">POST</stringProp></HTTPSamplerProxy><hashTree><JSR223PostProcessor guiclass="TestBeanGUI" testclass="JSR223PostProcessor" testname="201 o agotado esperado"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def ok=prev.getResponseCode()=='201'||(prev.getResponseCode()=='409'&amp;&amp;prev.getResponseDataAsString().contains('INSUFFICIENT_STOCK'));prev.setSuccessful(ok)</stringProp></JSR223PostProcessor><hashTree/></hashTree>
</hashTree></hashTree></hashTree></jmeterTestPlan>