tests/results/fase6/jmeter/plans/JM-DIS-01-estabilidad.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JM-DIS-01 Estabilidad 5 minutos" enabled="true"/><hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Carga estable"><stringProp name="ThreadGroup.num_threads">${__P(threads,10)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp,10)}</stringProp><stringProp name="ThreadGroup.duration">${__P(duration,300)}</stringProp><stringProp name="ThreadGroup.delay">0</stringProp><boolProp name="ThreadGroup.scheduler">true</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">true</boolProp><stringProp name="LoopController.loops">-1</stringProp></elementProp></ThreadGroup><hashTree>
<ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP defaults"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp><stringProp name="HTTPSampler.response_timeout">10000</stringProp></ConfigTestElement><hashTree/><ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Pausa"><stringProp name="ConstantTimer.delay">${__P(delay,6000)}</stringProp></ConstantTimer><hashTree/>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DIS01 GET frontend"><stringProp name="HTTPSampler.domain">${__P(frontendHost,127.0.0.1)}</stringProp><stringProp name="HTTPSampler.port">${__P(frontendPort,3302)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(frontendProtocol,http)}</stringProp><stringProp name="HTTPSampler.path">/</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Frontend HTTP 200"><collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
<HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DIS01 GET productos"><stringProp name="HTTPSampler.path">/api/productos</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy><hashTree><ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="HTTP 200"><collectionProp name="Asserion.test_strings"><stringProp name="1">200</stringProp></collectionProp><stringProp name="Assertion.test_field">Assertion.response_code</stringProp><intProp name="Assertion.test_type">8</intProp></ResponseAssertion><hashTree/></hashTree>
</hashTree></hashTree></hashTree></jmeterTestPlan>