tests/results/fase6/jmeter/plans/JM-ESC-02-dataset-100.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3"><hashTree><TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="JM-ESC-02 Dataset 100" enabled="true"/><hashTree><ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Consultas admin"><stringProp name="ThreadGroup.num_threads">${__P(threads,25)}</stringProp><stringProp name="ThreadGroup.ramp_time">${__P(ramp,5)}</stringProp><boolProp name="ThreadGroup.scheduler">false</boolProp><elementProp name="ThreadGroup.main_controller" elementType="LoopController"><boolProp name="LoopController.continue_forever">false</boolProp><stringProp name="LoopController.loops">${__P(loops,3)}</stringProp></elementProp></ThreadGroup><hashTree><ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP defaults"><elementProp name="HTTPsampler.Arguments" elementType="Arguments"><collectionProp name="Arguments.arguments"/></elementProp><stringProp name="HTTPSampler.domain">${__P(host,localhost)}</stringProp><stringProp name="HTTPSampler.port">${__P(port,3000)}</stringProp><stringProp name="HTTPSampler.protocol">${__P(protocol,http)}</stringProp></ConfigTestElement><hashTree/><HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="Admin"><collectionProp name="HeaderManager.headers"><elementProp name="Cookie" elementType="Header"><stringProp name="Header.name">Cookie</stringProp><stringProp name="Header.value">elpoblano_session=${__P(adminToken)}</stringProp></elementProp></collectionProp></HeaderManager><hashTree/><HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="ESC02 GET 100 pedidos"><stringProp name="HTTPSampler.path">/api/pedidos/admin?page=1&amp;limit=50</stringProp><stringProp name="HTTPSampler.method">GET</stringProp></HTTPSamplerProxy><hashTree><JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Página válida"><stringProp name="scriptLanguage">groovy</stringProp><stringProp name="script">def j=new groovy.json.JsonSlurper().parseText(prev.getResponseDataAsString()); if(prev.getResponseCode()!='200'||j.data.size()&gt;50||j.pagination.total&lt;100){AssertionResult.setFailure(true);AssertionResult.setFailureMessage('Dataset/paginación inválido')}</stringProp></JSR223Assertion><hashTree/></hashTree></hashTree></hashTree></hashTree></jmeterTestPlan>